vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/osc32kctrl.h
/* -------- OSC32KCTRL_INTFLAGSET : (OSC32KCTRL Offset: 0x10) (R/W 32) Interrupt Flag Software Set -------- */
#define OSC32KCTRL_INTFLAGSET_RESETVALUE      _UINT32_(0x00)                                       /*  (OSC32KCTRL_INTFLAGSET) Interrupt Flag Software Set  Reset Value */

#define OSC32KCTRL_INTFLAGSET_XOSC32KRDY_Pos  _UINT32_(0)                                          /* (OSC32KCTRL_INTFLAGSET) XOSC32K Ready Position */
#define OSC32KCTRL_INTFLAGSET_XOSC32KRDY_Msk  (_UINT32_(0x1) << OSC32KCTRL_INTFLAGSET_XOSC32KRDY_Pos) /* (OSC32KCTRL_INTFLAGSET) XOSC32K Ready Mask */
#define OSC32KCTRL_INTFLAGSET_XOSC32KRDY(value) (OSC32KCTRL_INTFLAGSET_XOSC32KRDY_Msk & (_UINT32_(value) << OSC32KCTRL_INTFLAGSET_XOSC32KRDY_Pos)) /* Assignment of value for XOSC32KRDY in the OSC32KCTRL_INTFLAGSET register */
#define OSC32KCTRL_INTFLAGSET_OSC32KRDY_Pos   _UINT32_(1)                                          /* (OSC32KCTRL_INTFLAGSET) OSC32K Ready Position */
#define OSC32KCTRL_INTFLAGSET_OSC32KRDY_Msk   (_UINT32_(0x1) << OSC32KCTRL_INTFLAGSET_OSC32KRDY_Pos) /* (OSC32KCTRL_INTFLAGSET) OSC32K Ready Mask */
#define OSC32KCTRL_INTFLAGSET_OSC32KRDY(value) (OSC32KCTRL_INTFLAGSET_OSC32KRDY_Msk & (_UINT32_(value) << OSC32KCTRL_INTFLAGSET_OSC32KRDY_Pos)) /* Assignment of value for OSC32KRDY in the OSC32KCTRL_INTFLAGSET register */
#define OSC32KCTRL_INTFLAGSET_CLKFAIL_Pos     _UINT32_(2)                                          /* (OSC32KCTRL_INTFLAGSET) XOSC32K Clock Failure Detected Position */
#define OSC32KCTRL_INTFLAGSET_CLKFAIL_Msk     (_UINT32_(0x1) << OSC32KCTRL_INTFLAGSET_CLKFAIL_Pos) /* (OSC32KCTRL_INTFLAGSET) XOSC32K Clock Failure Detected Mask */
#define OSC32KCTRL_INTFLAGSET_CLKFAIL(value)  (OSC32KCTRL_INTFLAGSET_CLKFAIL_Msk & (_UINT32_(value) << OSC32KCTRL_INTFLAGSET_CLKFAIL_Pos)) /* Assignment of value for CLKFAIL in the OSC32KCTRL_INTFLAGSET register */
#define OSC32KCTRL_INTFLAGSET_Msk             _UINT32_(0x00000007)                                 /* (OSC32KCTRL_INTFLAGSET) Register Mask  */


/* -------- OSC32KCTRL_STATUS : (OSC32KCTRL Offset: 0x14) ( R/ 32) Status -------- */
#define OSC32KCTRL_STATUS_RESETVALUE          _UINT32_(0x00)                                       /*  (OSC32KCTRL_STATUS) Status  Reset Value */

#define OSC32KCTRL_STATUS_XOSC32KRDY_Pos      _UINT32_(0)                                          /* (OSC32KCTRL_STATUS) XOSC32K Ready Position */
#define OSC32KCTRL_STATUS_XOSC32KRDY_Msk      (_UINT32_(0x1) << OSC32KCTRL_STATUS_XOSC32KRDY_Pos)  /* (OSC32KCTRL_STATUS) XOSC32K Ready Mask */
#define OSC32KCTRL_STATUS_XOSC32KRDY(value)   (OSC32KCTRL_STATUS_XOSC32KRDY_Msk & (_UINT32_(value) << OSC32KCTRL_STATUS_XOSC32KRDY_Pos)) /* Assignment of value for XOSC32KRDY in the OSC32KCTRL_STATUS register */
#define OSC32KCTRL_STATUS_OSC32KRDY_Pos       _UINT32_(1)                                          /* (OSC32KCTRL_STATUS) OSC32K Ready Position */
#define OSC32KCTRL_STATUS_OSC32KRDY_Msk       (_UINT32_(0x1) << OSC32KCTRL_STATUS_OSC32KRDY_Pos)   /* (OSC32KCTRL_STATUS) OSC32K Ready Mask */
#define OSC32KCTRL_STATUS_OSC32KRDY(value)    (OSC32KCTRL_STATUS_OSC32KRDY_Msk & (_UINT32_(value) << OSC32KCTRL_STATUS_OSC32KRDY_Pos)) /* Assignment of value for OSC32KRDY in the OSC32KCTRL_STATUS register */
#define OSC32KCTRL_STATUS_CLKFAIL_Pos         _UINT32_(2)                                          /* (OSC32KCTRL_STATUS) XOSC32K Clock Failure Detected Position */
#define OSC32KCTRL_STATUS_CLKFAIL_Msk         (_UINT32_(0x1) << OSC32KCTRL_STATUS_CLKFAIL_Pos)     /* (OSC32KCTRL_STATUS) XOSC32K Clock Failure Detected Mask */
#define OSC32KCTRL_STATUS_CLKFAIL(value)      (OSC32KCTRL_STATUS_CLKFAIL_Msk & (_UINT32_(value) << OSC32KCTRL_STATUS_CLKFAIL_Pos)) /* Assignment of value for CLKFAIL in the OSC32KCTRL_STATUS register */
#define OSC32KCTRL_STATUS_CLKSW_Pos           _UINT32_(3)                                          /* (OSC32KCTRL_STATUS) XOSC32K Clock Switch Position */
#define OSC32KCTRL_STATUS_CLKSW_Msk           (_UINT32_(0x1) << OSC32KCTRL_STATUS_CLKSW_Pos)       /* (OSC32KCTRL_STATUS) XOSC32K Clock Switch Mask */
#define OSC32KCTRL_STATUS_CLKSW(value)        (OSC32KCTRL_STATUS_CLKSW_Msk & (_UINT32_(value) << OSC32KCTRL_STATUS_CLKSW_Pos)) /* Assignment of value for CLKSW in the OSC32KCTRL_STATUS register */
#define OSC32KCTRL_STATUS_Msk                 _UINT32_(0x0000000F)                                 /* (OSC32KCTRL_STATUS) Register Mask  */


/* -------- OSC32KCTRL_RTCCTRL : (OSC32KCTRL Offset: 0x18) (R/W 32) RTC Control -------- */
#define OSC32KCTRL_RTCCTRL_RESETVALUE         _UINT32_(0x00)                                       /*  (OSC32KCTRL_RTCCTRL) RTC Control  Reset Value */

#define OSC32KCTRL_RTCCTRL_RTCSEL_Pos         _UINT32_(0)                                          /* (OSC32KCTRL_RTCCTRL) RTC Clock Source Selection Position */
#define OSC32KCTRL_RTCCTRL_RTCSEL_Msk         (_UINT32_(0x7) << OSC32KCTRL_RTCCTRL_RTCSEL_Pos)     /* (OSC32KCTRL_RTCCTRL) RTC Clock Source Selection Mask */
#define OSC32KCTRL_RTCCTRL_RTCSEL(value)      (OSC32KCTRL_RTCCTRL_RTCSEL_Msk & (_UINT32_(value) << OSC32KCTRL_RTCCTRL_RTCSEL_Pos)) /* Assignment of value for RTCSEL in the OSC32KCTRL_RTCCTRL register */
#define   OSC32KCTRL_RTCCTRL_RTCSEL_OSC1K_Val _UINT32_(0x2)                                        /* (OSC32KCTRL_RTCCTRL) 1.024 kHz from the internal 32.768 kHz oscillator  */
#define   OSC32KCTRL_RTCCTRL_RTCSEL_OSC32K_Val _UINT32_(0x3)                                        /* (OSC32KCTRL_RTCCTRL) 32.768 kHz from the internal 32.768 kHz oscillator  */
#define   OSC32KCTRL_RTCCTRL_RTCSEL_XOSC1K_Val _UINT32_(0x4)                                        /* (OSC32KCTRL_RTCCTRL) 1.024 kHz from the external 32.768 kHz crystal oscillator  */
#define   OSC32KCTRL_RTCCTRL_RTCSEL_XOSC32K_Val _UINT32_(0x5)                                        /* (OSC32KCTRL_RTCCTRL) 32.768 kHz from the external 32.768 kHz crystal oscillator  */
#define OSC32KCTRL_RTCCTRL_RTCSEL_OSC1K       (OSC32KCTRL_RTCCTRL_RTCSEL_OSC1K_Val << OSC32KCTRL_RTCCTRL_RTCSEL_Pos) /* (OSC32KCTRL_RTCCTRL) 1.024 kHz from the internal 32.768 kHz oscillator Position */
#define OSC32KCTRL_RTCCTRL_RTCSEL_OSC32K      (OSC32KCTRL_RTCCTRL_RTCSEL_OSC32K_Val << OSC32KCTRL_RTCCTRL_RTCSEL_Pos) /* (OSC32KCTRL_RTCCTRL) 32.768 kHz from the internal 32.768 kHz oscillator Position */
#define OSC32KCTRL_RTCCTRL_RTCSEL_XOSC1K      (OSC32KCTRL_RTCCTRL_RTCSEL_XOSC1K_Val << OSC32KCTRL_RTCCTRL_RTCSEL_Pos) /* (OSC32KCTRL_RTCCTRL) 1.024 kHz from the external 32.768 kHz crystal oscillator Position */
#define OSC32KCTRL_RTCCTRL_RTCSEL_XOSC32K     (OSC32KCTRL_RTCCTRL_RTCSEL_XOSC32K_Val << OSC32KCTRL_RTCCTRL_RTCSEL_Pos) /* (OSC32KCTRL_RTCCTRL) 32.768 kHz from the external 32.768 kHz crystal oscillator Position */
#define OSC32KCTRL_RTCCTRL_Msk                _UINT32_(0x00000007)                                 /* (OSC32KCTRL_RTCCTRL) Register Mask  */


/* -------- OSC32KCTRL_XOSC32KCTRL : (OSC32KCTRL Offset: 0x1C) (R/W 32) XOSC32K Control -------- */
#define OSC32KCTRL_XOSC32KCTRL_RESETVALUE     _UINT32_(0x80)                                       /*  (OSC32KCTRL_XOSC32KCTRL) XOSC32K Control  Reset Value */

